:PROPERTIES:
:ID: f807e5c7-198d-4d13-9105-68513d07c193
:END:
#+title: History
#+description: History
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:currencies:
#+created: 2026-05-21
#+updated: 2026-05-21

Get version history for a currency.

#+name: currencies-history
#+begin_src ores-shell :exports none
currencies history USD
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<currencies-history>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell>
+---------+----------+-----------+-------------+-------------------------------+----------------+
| Version | ISO Code | Name      | Recorded By | Recorded At                   | Change Summary |
+---------+----------+-----------+-------------+-------------------------------+----------------+
| 2       | USD      | US Dollar | newuser3    | 2026-01-09 21:05:44.000000000 | Version 2      |
| 1       | USD      | US Dollar | system      | 2026-01-09 16:37:39.000000000 | Version 1      |
+---------+----------+-----------+-------------+-------------------------------+----------------+


ores-shell> Bye!
#+end_example
